Revit 2027 API
LinkNode Methods
The LinkNode type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDocument |  Returns the document associated with the link.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTransform |  A transformation matrix associated with the node.
(Inherited from GroupNode)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
LinkNode Class
Autodesk.Revit.DB Namespace